# sqwrl
### Sqlachemy Query WRapper Library

## Initialization

In [1]:
import pandas as pd
from sqwrl import DB
db = DB('sqlite:///:memory:') # verbose=True to see what SQL is being executed
list(db)

[]

In [2]:
df = pd.DataFrame({"x": [1,2,3,4,5], "y": list("abcdf"), "z": [1.0, 1.5, 1.5, 1.2, 1.3]}).set_index("y")
df2 = pd.DataFrame({"x": [1,2,3,4,5], "y": list("aaccg"), "z": [1.0, 1.5, 1.5, 1.2, 1.3], "w": list("ABBDD")}).set_index("x")
ans_df = pd.read_csv("tests/anscombe.csv")
db["test1"] = df
db["test2"] = df2
db["anscombe"] = ans_df
tbl1 = db["test1"]
tbl2 = db["test2"]
ans_tbl = db["anscombe"]
list(db)

['anscombe', 'test1', 'test2']

In [3]:
df.dtypes

x      int64
z    float64
dtype: object

In [4]:
df2.dtypes

y     object
z    float64
w     object
dtype: object

In [5]:
ans_df.dtypes

dataset     object
x            int64
y          float64
dtype: object

In [6]:
repr(tbl1), repr(tbl2), repr(ans_tbl)

('<sqwrl.Table object at 0x7f50d1770a00>',
 '<sqwrl.Table object at 0x7f50d1770670>',
 '<sqwrl.Table object at 0x7f509b109580>')

## IPython Display

In [7]:
ans_tbl

In [8]:
tbl1

In [9]:
tbl2

## Pandas-like Attribues

In [10]:
len(ans_tbl)

44

In [11]:
ans_tbl.dtypes

dataset     object
x            int64
y          float64
dtype: object

## Pandas-like Queries

In [12]:
ans_tbl[["dataset", "x"]]

In [13]:
ans_tbl[ans_tbl["dataset"] == "II"][["x", "y"]]

In [14]:
len(ans_tbl[ans_tbl["dataset"] == "II"]), len(ans_tbl[ans_tbl["dataset"].isin(["I", "II"])])

(11, 22)

## Pandas-like Groupbys

In [15]:
ans_tbl.groupby("dataset").mean()

           x         y
dataset
I        9.0  7.500909
II       9.0  7.500909
III      9.0  7.500000
IV       9.0  7.500909

In [16]:
ans_tbl.groupby("dataset").get_group("IV")

In [17]:
for ix, group in ans_df.groupby("dataset"):
    print(group.mean())
    print(group.sum())
    break

x    9.000000
y    7.500909
dtype: float64
dataset    IIIIIIIIIII
x                   99
y                82.51
dtype: object

In [18]:
for ix, group in ans_tbl.groupby("dataset"):
    print(group.mean())
    print(group.sum())
    break

dataset   NaN
x         NaN
y         NaN
dtype: float64
dataset   NaN
x         NaN
y         NaN
dtype: float64